# 19. Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора 
# псевдослучайных чисел
import time
# def rand(a,b):
#     list = []
#     for i in range(a,b+1):
#         list.append(i)
#     rand_num = list[5]
#     return rand_num

# print(rand(-10,10))

a = time.time()
print(a)