# Дан список чисел. Создать список в который попадают числа, описывающие возрастающую последовательность и 
# содержащие максимальное количество элементов. 
# Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3, 4, 6, 7]
#    [5, 2, 3, 4, 6, 1, 7] => [2, 3, 4, 6, 7]
#  Порядок элементов менять нельзя


list = [1, 5, 2, 3, 4, 6, 1, 7]
new_list = []
for i in range(len(list)-1):
    if list[i] 
            new_list.append(list[i])
            
print(new_list)