# 2. Даны два числа. Показать большее и меньшее число

a = 5
b = 3
if a>b:
    print(f'Большее число {a}, меньшее число {b}')
else:
    print(f'Большее число {b}, меньшее число {a}')