# 5. Написать программу вычисления значения функции y = f(a)  (в данном примере y = sin(x)/x)
from math import *
def y(x):
    return sin(x)/x
print(y(10))
